{"posts": [{
  "author": "Dracula",
  "title": "Dracula's Guest",
  "tags": "",
  "date": "",
  "content": "The short story Dracula's Guest was posthumously published in 1914, two years after Stoker's death. It was, according to most contemporary critics, the deleted first (or second) chapter from the original manuscript[4] and the one which gave the volume its name,[5]:325 but which the original publishers deemed unnecessary to the overall story.Dracula's Guest follows an unnamed Englishman traveller as he wanders around Munich before leaving for Transylvania. It is Walpurgis Night and the young Englishman foolishly leaves his hotel, in spite of the coachman's warnings, and wanders through a dense forest alone. Along the way, he feels that he is being watched by a tall and thin stranger (possibly Count Dracula).The short story climaxes in an old graveyard, where the Englishman encounters a sleeping female vampire called Countess Dolingen in a marble tomb with a large iron stake driven into it. This malevolent and beautiful vampire awakens from her marble bier to conjure a snowstorm before being struck by lightning and returning to her eternal prison. However, the Englishman's troubles are not quite over, as he is dragged away by an unseen force and rendered unconscious. He awakens to find a gigantic wolf lying on his chest and licking at his throat; however, the wolf merely keeps him warm and protects him until help arrives. When the Englishman is finally taken back to his hotel, a telegram awaits him from his expectant host Dracula, with a warning about dangers from snow and wolves and night. Deleted ending[edit] A small section was removed from the original final chapter, in which Dracula's castle falls apart as he dies, hiding the fact that vampires were ever there. As we looked there came a terrible convulsion of the earth so that we seemed to rock to and fro and fell to our knees. At the same moment with a roar which seemed to shake the very heavens the whole castle and the rock and even the hill on which it stood seemed to rise into the air and scatter in fragments while a mighty cloud of black and yellow smoke volume on volume in rolling grandeur was shot upwards with inconceivable rapidity. Then there was a stillness in nature as the echoes of that thunderous report seemed to come as with the hollow boom of a thunder-clap - the long reverberating roll which seems as though the floors of heaven shook. Then down in a mighty ruin falling whence they rose came the fragments that had been tossed skywards in the cataclysm. From where we stood it seemed as though the one fierce volcano burst had satisfied the need of nature and that the castle and the structure of the hill had sunk again into the void. We were so appalled with the suddenness and the grandeur that we forgot to think of ourselves.",
  "image": "https://upload.wikimedia.org/wikipedia/en/0/0a/Draculasguest.jpg"
  }, {
  "author": "Frankenstein's Monster",
  "title": "Frankenstein",
  "tags": "",
  "date": "",
  "content": "Ravaged by grief and guilt, Victor retreats into the mountains. The Creature finds him and pleads for Victor to hear his tale. Intelligent and articulate, the Creature relates his first days of life, living alone in the wilderness and finding that people were afraid of and hated him due to his appearance, which led him to fear and hide from them. While living in an abandoned structure connected to a cottage, he grew fond of the poor family living there, and discreetly collected firewood for them. Secretly living among the family for months, the Creature learned to speak by listening to them and he taught himself to read after discovering a lost satchel of books in the woods. When he saw his reflection in a pool, he realized his physical appearance was hideous, and it terrified him as it terrifies normal humans. Nevertheless, he approached the family in hopes of becoming their friend. Initially he was able to befriend the blind father figure of the family, but the rest of them were frightened and they all fled their home, resulting in the Creature burning the cottage in a fit of rage. He then swore revenge on his creator for bringing him into a world that hated him. He traveled to Victor's family estate using details from Victor's journal, murdered William, and framed Justine.",
  "image": "http://static.srcdn.com/slir/w1000-h501-q90-c1000:501/wp-content/uploads/Frankenstein-pg-7.jpg"
  }, {
  "author": "Lycaon",
  "title": "Lycaon (Arcadia)",
  "tags": "",
  "date": "",
  "content": "There was no widespread belief in werewolves in medieval Europe before the 14th century. There were some examples of man-wolf transformations in the court literature of the time, notably Marie de France's poem Bisclavret (c. 1200), in which the nobleman Bizuneh, for reasons not described, had to transform into a wolf every week. When his treacherous wife stole his clothing needed to restore his human form, he escaped the king's wolf hunt by imploring the king for mercy and accompanied the king thereafter. His behaviour at court was so much gentler than when his wife and her new husband appeared at court, that his hateful attack on the couple was deemed justly motivated, and the truth was revealed.",
  "image": "https://lh3.googleusercontent.com/-JygtaT4pmVw/T2dH27AIZdI/AAAAAAAAA0A/z6qbHSLSppA/s447-Ic42/lycaon2.JPG"  
  }]
}
